const banks = new Map([
  ["636214", "آینده"],
  ["627381", "انصار"],
  ["627412", "اقتصاد نوین"],
  ["507677", "ایران زمین"],
  ["589210", "سپه"],
  ["639607", "سرمایه"],
  ["639346", "سینا"],
  ["627961", "صنعت و معدن"],
  ["603769", "صادرات ایران"],
  ["622106", "پارسیان"],
  ["502229", "پاسارگاد"],
  ["504706", "رسالت"],
  ["589463", "رفاه"],
  ["636949", "حکمت ایرانیان"],
  ["603770", "کشاورزی"],
  ["627488", "کارآفرین"],
  ["610433", "ملت"],
  ["603799", "ملی ایران"],
  ["606373", "مهر ایران"],
  ["639370", "مهر اقتصاد"],
  ["628023", "مسکن"],
  ["502908", "توسعه تعاون"],
  ["502938", "دی"],
  ["639599", "قوامین"],
  ["621986", "سامان / بلو بانک"],
  ["502806", "شهر"],
  ["627353", "تجارت"],
  ["505416", "گردشگری"],
]);

const input = "6037991234567890";

const bin = input.slice(0, 6);

const detectBank = banks.get(bin) || "نامشخص";
